<template>
	<view>
		<view class="agreement-title">
			巨拼商城协议
		</view>
		<view class="agreement-content">
			欢迎使用
			“广州巨拼网络科技有限公司”服务（以下称“巨拼商城”、“巨拼商城平台”），为了保障您的权益，请在使用“巨拼商城”前，详细阅读此服务协议（以下简称“本协议”）的所有内容，特别是加粗部分。当您勾选“我已阅读并同意《巨拼商城平台服务协议》”时，您的行为表示您同意并签署了本协议，并同意遵守本协议中的约定。广州巨拼商城网络技术有限公司（以下简称“公司”）是巨拼商城App（以下简称“本软件”）的所有者和运营者，本协议构成您与公司达成的协议，具有法律效力。根据国家法律法规变化及本软件运营需要，巨拼商城有权对本协议条款及相关规则不时地进行修改，修改后的内容会提前7日在本软件上公示，修改后的协议取代此前相关内容，您应不时关注本软件公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本软件；如您继续使用本软件，即视为知悉并同意接受变动内容。
		</view>
		<view class="agreement-content big">
			一、服务需知
		</view>
		<view class="agreement-content">
			1、本软件运用自身开发的操作系统通过互联网络为用户提供购买商品等服务。使用本软件，您必须：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（1）自行配备上网的所需设备，包括个人手机、平板电脑、调制解调器、路由器等；
				</view>
				<view class="">
					（2）自行负担个人上网所支付的与此服务有关的电话费用、网络费用等；
				</view>
				<view class="">
					（3）选择与所安装终端设备相匹配的软件版本，包括但不限于iOS、Android、iPad等多个巨拼商城发布的应用版本。
				</view>
			</view>
		</view>
		<view class="agreement-content">
			2、基于本软件所提供的网络服务的重要性，您确认并同意：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（1）提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；
				</view>
				<view class="">
					（2）如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且巨拼商城保留终止您使用本软件各项服务的权利。
				</view>
			</view>
		</view>
		<view class="agreement-content">
			3、巨拼商城是为用户提供获取商品和服务信息、就商品和服务的交易进行协商及开展交易的电子商务平台，平台上的所有商品和服务由巨拼商城或商家（以下统称为“销售商”）向用户提供，并承担其商品和服务（以下统称为“商品”）的质量保证责任。
		</view>
		<view class="agreement-content big">
			二、定义
		</view>
		<view class="agreement-content">
			1、巨拼商城是由公司所有和运营的分享类电商平台，用户登录巨拼商城平台后，可以浏览平台上由各销售商发布的商品和服务信息，进行商品和/或服务交易等活动。在本协议项下，巨拼商城服务的所有方、运营方会根据巨拼商城业务调整的需要而变更，上述变更不会影响或削减您在本协议项下享有的权益。巨拼商城服务的所有方、运营方还有可能因为提供新的服务而新增，如您使用新增的服务的，则视为您已经接受新增的巨拼商城所有方与运营方。
		</view>
		<view class="agreement-content">
			2、商家是指通过巨拼商城平台陈列、销售商品或服务，并最终和用户完成交易的主体，是商品和服务的供应商和销售商。
		</view>
		<view class="agreement-content big">
			三、巨拼商城使用规则
		</view>
		<view class="agreement-content">
			1、您可浏览巨拼商城陈列的商品或服务信息，如您希望选购并支付订单的，您需先登录或注册帐号，并根据页面提示提交选购的商品信息和个人信息，包括但不限于数量、规格、手机、姓名、身份证号码、送货地址等信息。如您提供的信息过期、无效进而导致销售商或巨拼商城无法与您取得联系的，因此导致您在使用巨拼商城服务中产生任何损失或增加费用的，应由您完全独自承担。
		</view>
		<view class="agreement-content">
			2、您在注册时承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在注册资料中出现违法和不良信息，且您保证在注册和使用帐号时，不得有以下情形：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（a）违反宪法或法律法规规定的；
				</view>
				<view class="">
					（b）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
				</view>
				<view class="">
					（c）损害国家荣誉和利益的，损害公共利益的；
				</view>
				<view class="">
					（d）煽动民族仇恨、民族歧视，破坏民族团结的；
				</view>
				<view class="">
					（e）破坏国家宗教政策，宣扬邪教和封建迷信的；
				</view>
				<view class="">
					（f）散布谣言，扰乱社会秩序，破坏社会稳定的；
				</view>
				<view class="">
					（g）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
				</view>
				<view class="">
					（h）侮辱或者诽谤他人，侵害他人合法权益的；
				</view>
				<view class="">
					（i）含有法律、行政法规、巨拼商城平台禁止的其他内容的。
				</view>
			</view>
			若您提供给巨拼商城的帐号注册资料不准确，不真实，含有违法或不良信息的，巨拼商城有权不予注册，并保留终止您使用巨拼商城各项服务的权利。若您以虚假信息骗取帐号注册或帐号头像、个人简介等注册资料存在违法和不良信息的，巨拼商城有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册帐号名称的，巨拼商城有权注销该帐号，并向政府主管部门进行报告。
		</view>
		<view class="agreement-content">
			3、您确认：在使用巨拼商城服务过程中，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，巨拼商城有权向您的监护人追偿。
		</view>
		<view class="agreement-content">
			4、您同意并保证：巨拼商城有权记录您在选购商品或服务时，在线填写的所有信息并提供给销售商、第三方服务提供者（包括但不限于物流公司）或巨拼商城的关联公司。您保证该等信息准确、合法，您承担因该等信息错误、非法等导致的后果。您授权巨拼商城在本服务期间有权使用上述信息及向有关第三方提供该信息。
		</view>
		<view class="agreement-content">
			5、巨拼商城平台上的商品和服务的价格、数量等信息随时可能发生变动，对此巨拼商城平台不作特别通知。由于巨拼商城平台上的商品的数量庞大、互联网技术因素等客观原因存在，巨拼商城平台上显示的信息可能存在一定的滞后和误差，对此请您知悉并理解。为最大限度的提高平台上商品信息的准确性、及时性、完整性和有效性，巨拼商城平台有权对商品信息进行及时的监测、修改或删除。如您提交订单后，巨拼商城平台发现平台的相关页面上包括但不限于商品名称、价格或数量价格等关键信息存在标注错误的，有权取消错误订单并及时通知销售商和您。
		</view>
		<view class="agreement-content">
			6、您理解并同意：巨拼商城实行先付款后发货的方式，您及时、足额、合法的支付选购商品或服务所需的款项是销售商给您发货的前提。
		</view>
		<view class="agreement-content">
		7、您支付交易款项过程中，将被分享复查选购商品或服务的信息，包括单价、购买数量，付款方式，商品的运输方式和费用等。前述存储于巨拼商城服务器的订单信息被认为是您的该次交易对应的发货、退货和争议事项的证据。您点击“提交订单”意味着您认可订单表格中包含的所有信息都是正确和完整的。由于众所周知的互联网技术因素等客观原因存在，巨拼商城显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解。由于排版错误或信息错误的情况下以不正确的价格列出来的商品，巨拼商城有拒绝或取消任何对以不正确的价格列出来的商品所下订单的权利。	
		</view>
		<view class="agreement-content">
		8、您理解并同意：本软件上销售商展示的商品和价格等信息仅仅是要约分享，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商发出的合同要约；销售商收到您的订单信息后，只有在销售商将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售商之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售商只给您发出了部分商品时，您与销售商之间仅就实际直接向您发出的商品建立了合同关系；只有在销售商实际直接向您发出了订单中订购的其他商品时，您和销售商之间就订单中其他已实际直接向您发出的商品才成立合同关系。对于电子书、数字音乐、在线手机充值等数字化商品，您下单并支付货款后合同即成立。在您与销售商的买卖合同成立之前，您与销售商均有权取消相关商品的订单，订单取消后，您已支付的款项将退回您的付款账户。	
		</view>
		<view class="agreement-content">
			9、您所选购的商品将被送至订单表格上注明的送货地址，具体物流服务由您所选购的商品的销售商提供。无论何种原因该商品不能送达到送货地址，请您尽快跟巨拼商城客服热线取得联系，巨拼商城平台将通知销售商进行解决。
		</view>
		<view class="agreement-content">
			10、您可以随时使用自己的帐号和登录密码登录巨拼商城平台，查询订单状态。
		</view>
		<view class="agreement-content">
			11、在巨拼商城平台上列出的所有送货时间仅为参考时间，如因以下情况造成订单延迟或无法配送、交货等，销售商不承担延迟配送、交货的责任，并有权在必要时取消订单：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（1）用户提供的信息错误、地址不详细等原因导致的；
				</view>
				<view class="">
					（2）货物送达后无人签收，导致无法配送或延迟配送的；
				</view>
				<view class="">
					（3）情势变更因素导致的；
				</view>
				<view class="">
					（4）因节假日、大型促销活动、预购或抢购人数众多等原因导致的；
				</view>
				<view class="">
					（5）不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。
				</view>
			</view>
		</view>
		<view class="agreement-content">
			12、您有权在巨拼商城平台上发布内容，同时也有义务独立承担您在巨拼商城平台所发布内容的责任。用户发布的内容必须遵守法律法规及巨拼商城平台的相关规定。您承诺不得发布以下内容，否则一经发现巨拼商城平台有义务立即停止传输，保存有关记录，向国家有关机关报告，删除该内容或停止您的帐号的使用权限，并保留对您追究法律责任的权利。
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（1）侵犯他人知识产权或其他合法权利的相关内容；
				</view>
				<view class="">
					（2）透露他人隐私信息，包括但不限于真实姓名、联系方式、家庭住址、照片、站内短信、聊天记录、社交网络帐号等；
				</view>
				<view class="">
					（3）发布商业广告或在评论区域发布广告链接；
				</view>
				<view class="">
					（4）相关法律、行政法规、巨拼商城平台禁止的其他内容。
				</view>
			</view>
		</view>
		<view class="agreement-content">
			13、巨拼商城平台进行优惠、促销的目的是为满足广大用户的消费需求，一切以牟利、排挤竞争为意图或者为达到其它恶意目的的参与行为均不予接受。若您存在以下不正当行为，一经发现巨拼商城平台有权会同销售商采取包括但不限于暂停发货、取消订单、拦截已发货的订单、限制账户权限等措施：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（1）将自有账户内的优惠、促销信息转卖、转让予他人；
				</view>
				<view class="">
					（2）通过巨拼商城平台及其合作商的合法活动页面之外的第三方交易渠道获得优惠券并在巨拼商城平台进行使用；
				</view>
				<view class="">
					（3）在巨拼商城平台通过不正当手段恶意批量刷取优惠券并在巨拼商城平台进行使用；
				</view>
				<view class="">
					（4）利用软件、技术手段或其他方式在巨拼商城平台套取商品、优惠券、运费或者其他利益；
				</view>
				<view class="">
					（5）巨拼商城平台认定的或国家法律法规规定的其他不正当行为。
				</view>
				
			</view>
		</view>
		<view class="agreement-content">
			14、您理解并保证，您在使用巨拼商城服务的过程中遵守诚实信用原则，不扰乱巨拼商城的正常交易秩序，如果巨拼商城根据您的登录帐号下的交易记录及其他相关信息，发现您有以下任一情形的：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					（1）您此前通过巨拼商城购买的商品多数并非用于个人消费或使用用途的；
				</view>
				<view class="">
					（2）您此前存在多次（2次及以上）恶意购物行为的，即从事了相关购物行为，但积极主动终止购物目的或结果，或追求一般购物以外的目的或结果，对他人或巨拼商城（可能）造成消极影响的行为。
				</view>
				<view class="">
					（3）巨拼商城有合理理由怀疑您存在违反诚实信用原则的其他行为。
				</view>
				则，巨拼商城有权自行或根据销售商的要求拒绝您的购买需求，若您已下达订单的，巨拼商城有权单方面取消订单并通知销售商不予发货；同时，巨拼商城有权视情况冻结您的登录帐号，使之无法通过巨拼商城下达订单、购买商品。
			</view>
		</view>
		
		<view class="agreement-content">
			15、您可将您与销售商关于交易的争议提交巨拼商城，您同意委托巨拼商城单方判断与该争议相关的事实及应适用的规则，进而作出处理决定，该判断和决定将对您具有法律约束力。但您理解并同意，巨拼商城并非司法机构，仅能以普通人的身份对证据进行鉴别，巨拼商城对争议的处理完全是基于您的委托，巨拼商城无法保证争议处理结果符合您的期望，也不对争议处理结论承担任何责任。如您因此遭受损失，您同意自行向责任方追偿。
		</view>
		<view class="agreement-content">
			16、为使您能够及时、全面了解巨拼商城提供的各类商品、服务及活动，您了解并同意，在征得您的同意的前提下，巨拼商城可以通过您在注册、使用巨拼商城过程中提供的联系方式多次、长期向您发送各类商业性短信息。
		</view>
		<view class="agreement-content">
			17、您同意在签收商品时进行当场验收，确认商品外包装完好无损后方进行签收。若您在验收过程中发现商品存在外包装破损，您有权拒绝签收并应及时联系客服进行反馈处理；若您未对商品进行前述验收即签收的，即视为商品验收合格。若订单信息中的收货人委托他人进行商品代收，代收人的签收行为视同订单信息中的收货人本人已对商品进行签收。若商品签收后发生的毁损、遗失等情况，销售商及巨拼商城平台不承担任何责任。
		</view>
		<view class="agreement-content">
			18、您知悉并同意，巨拼商城平台将按照《隐私政策》的约定收集、使用并保护您的相关信息。
		</view>
		<view class="agreement-content">
			19、您知悉并同意，为更好地为您提供服务，巨拼商城平台会引入第三方为您提供服务，如您接受该第三方提供的服务的，您将与该第三方就服务事项签署相关协议。
			
		</view>
		<view class="agreement-content big">
			四、居间委托
		</view>
		<view class="agreement-content">
			1、您同意并委托巨拼商城为您提供居间服务，为您介绍、推荐商品或服务及其销售方，并协助您就购买商品或服务与销售方达成合意。
		</view>
		<view class="agreement-content">
			2、您知晓并认可，您应就巨拼商城提供的居间服务向巨拼商城给付报酬，具体居间服务费金额以您订单结算页面显示的金额为准。
			
		</view>
		<view class="agreement-content">
			3、如您与销售方达成取消订单或退货退款协议的，巨拼商城将依据您的申请，向您退还相应的居间服务费。
		</view>
		<view class="agreement-content big">
			五、跨境交易特别条款
		</view>
		<view class="agreement-content">
			1、您承诺所购买商品系您合理自用，针对保税区发货的各种商品，委托销售商代理申报、代缴税款等通关事宜，您保证遵守《中华人民共和国海关法》和国家相关法律法规，保证所提供的身份信息和收货信息真实完整，无侵犯他人权益的行为，以上委托关系系如实填写，您愿意接受海关、检验检疫机构及其他监管部门的监管，并承担相应法律责任。
		</view>
		<view class="agreement-content">
			2、您在选择销售商提供的港澳台或海外直运服务以及保税仓中，同意遵守以下约定：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					a) 您理解并同意巨拼商城平台或销售商无需向用户开具发票；
				</view>
				<view class="">
					b) 您同意授权销售商作为您的代表处理商品清关事宜；
				</view>
				<view class="">
					c) 您同意巨拼商城向销售商披露并使用用户的相关交易信息，包括收件人姓名，地址及联系方式、产品信息等；
				</view>
				<view class="">
					d) 您同意，根据中国的法律规定或办理商品清关手续之所需，销售商可将前述的交易信息向中国的海关、邮政机关披露；
				</view>
			</view>
		</view>
		<view class="agreement-content">
			3、跨境交易会产生进口税费、关税及其他费用（以下统称“进口费用”），订单结算页面上显示的商品价格均包含进口费用。
		</view>
		<view class="agreement-content big">
			七、其他约定
		</view>
		<view class="agreement-content">
			1、您如对本协议项下巨拼商城服务有任何疑问，请登录获取相关信息或拨打客服电话。
		</view>
		<view class="agreement-content">
			2、责任范围和限制
		</view>
		<view class="agreement-content">
			（1）您了解巨拼商城仅提供这一平台作为您获取商品或服务信息、物色交易对象、就商品和/或服务的交易进行协商及开展交易的非物理场所，但巨拼商城无法控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关商品及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。
		</view>
		<view class="agreement-content">
			（2）对发生下列情形之一所造成的不便或损害，巨拼商城免责：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					a 定期检查或施工，更新软硬件而造成的服务中断，或突发性的软硬件设备与电子通信设备故障；
				</view>
				<view class="">
					b 网络服务提供商线路或其他故障，黑客攻击、病毒入侵等，服务器遭受损害，无法正常运作；
				</view>
				<view class="">
					c 在紧急情况之下依照法律的规定而采取的措施；
				</view>
				<view class="">
					d 因您提供的身份信息不完整或不准确而导致的海关通关失败；
				</view>
				<view class="">
					e 您购买的商品因违反有关法律法规的规定而被海关扣留；
				</view>
				<view class="">
					f 您与其它任何第三方的纠纷。
				</view>
			</view>
		</view>
		<view class="agreement-content">
			（3）无论何种原因巨拼商城对您的购买行为的赔偿金额将不会超过您受到影响的当次购买行为已经实际支付的费用的总额。
		</view>
		<view class="agreement-content">
			3、所有权及知识产权：
		</view>
		<view class="agreement-content">
			<view class="agreement-content-bd">
				<view class="">
					1）巨拼商城上所有内容，包括但不限于文字、软件、声音、图片、录像、图表、网站架构、网站画面的安排、网页设计、在广告中的全部内容、商品以及其它信息均由巨拼商城或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经巨拼商城或其他权利人书面同意，您不得擅自使用、修改、全部或部分复制、公开传播、改变、散布、发行或公开发表、转载、引用、链接、抓取或以其他方式使用本平台程序或内容。如有违反，您同意承担由此给巨拼商城或其他权利人造成的一切损失。
				</view>
				<view class="">
					2）巨拼商城平台尊重知识产权并注重保护用户享有的各项权利。在巨拼商城平台上，用户可能需要通过发表评论等各种方式向巨拼商城平台提供内容。在此情况下，用户仍然享有此等内容的完整知识产权，但承诺不将已发表于本平台的信息，以任何形式发布或授权其他主体以任何方式使用。用户在提供内容时将授予巨拼商城平台一项全球性的免费许可，允许巨拼商城平台及其关联公司使用、传播、复制、修改、再许可、翻译、创建衍生作品、出版、表演及展示此等内容。
				</view>
				<view class="">
					3）巨拼商城不保证平台上由其他权利人提供的所有内容没有侵犯任何第三方的合法权益，如您认为前述内容侵犯您的合法权益，请及时与巨拼商城联系，巨拼商城将在法律规定范围内协助您解决问题。
				</view>
				<view class="">
				4、通知：所有发给您的通知都可通过短信息、常规的信件或在网站显著位置公告的方式进行传送。	
				</view>
				<view class="">
					5、您了解并同意，巨拼商城根据自身的判断，认为您的行为涉嫌违反本协议的条款，则巨拼商城有权暂停或停止向您提供服务，且无须为此向您或任何第三方承担责任。
				</view>
				<view class="">
					6.本协议适用中华人民共和国的法律。当本协议的任何内容与中华人民共和国法律相抵触时，应当以法律规定为准，同时相关条款将按法律规定进行修改或重新解释，而本协议其他部分的法律效力不变。
				</view>
				<view class="">
					7、如用户在使用巨拼商城服务过程中出现纠纷，应进行友好协商，若协商不成，应将纠纷提交公司所在地人民法院提起诉讼。
				</view>
				<view class="">
					8、本协议自发布之日起实施，并构成您和公司之间的协议。本协议的最终解释权归属于公司。
				</view>
				
			</view>
		</view>
		
	</view>
</template>

<script>
	export default {
		data() {
			return {

			};
		}
	}
</script>

<style lang="scss">
	.agreement-title {
		height: 70rpx;
		font-size: 40rpx;
		font-weight: 600;
		text-align: center;
		line-height: 70rpx;
		color: #000000;
		margin-top: 80rpx;
		margin-bottom: 30rpx;
	}

	.agreement-content {
		padding: 0 20rpx;
		margin-bottom: 30rpx;
	}
	.big {
		font-weight: 700;
	}
	.agreement-content-bd {
		padding-left: 30rpx;
	}
</style>
